import numpy as np

a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

# Элементные операции
a + b            # → [5 7 9]
a * 2            # → [2 4 6]
a ** 2           # → [1 4 9]
a > 1            # → [False, True, True]
np.sum(a > 1)    # → 2

# Индексация и маски
a[a > 1]         # → [2 3]

# Произведения
print(a.dot(b))      # → 32 (скалярное произведение)
print(np.dot(a, b))  # → 32 (скалярное произведение)
print(a @ b)         # → 32 (скалярное произведение)

a.vectorize(b)  # → [4 10 18] (поэлементное произведение)
print(np.multiply(a, b))  # → [4 10 18] (поэлементное произведение)

np.cross(a, b)  # → [-3 6 -3] (векторное произведение)
np.outer(a, b)  # → [[4 5 6] [8 10 12] [12 15 18]] (внешнее (матричное) произведение)

